CSI API ETABS v1
cDCoAS_3600_2018.SetPreference Method
 Sets the value of a concrete design preference item.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetPreference(
	int Item,
	double Value
)
Function SetPreference (
	Item As Integer,
	Value As Double
) As Integer
Dim instance As cDCoAS_3600_2018
Dim Item As Integer
Dim Value As Double
Dim returnValue As Integer
returnValue = instance.SetPreference(Item,
	Value)
int SetPreference(
	int Item,
	double Value
)
abstract SetPreference :
        Item : int *
        Value : float -> int
Parameters
Item
Type: System.Int32
 This is an integer between 1 and 11, inclusive, indicating the preference item considered.
Number of interaction curves
Number of interaction points
Consider minimum eccentricity
Phi tension controlled
Phi compression controlled tied
Phi shear and/or torsion
Phi shear seismic
Phi joint shear
Pattern live load factor
Utilization factor limit
Multi-response case design
Value
Type: System.Double
 The value of the considered preference item.
 Number of interaction curves
 Value >= 4 and divisable by 4
 Number of interaction points
 Value >= 5 and odd
 Consider minimum eccentricity
 0 = No
 Any other value = Yes
 Phi tension controlled
 Value > 0
 Phi compression controlled tied
 Value > 0
 Phi shear and/or torsion
 Value > 0
 Phi shear seismic
 Value > 0
 Phi joint shear
 Value > 0
 Pattern live load factor
 Value >= 0
 Utilization factor limit
 Value > 0
 Multi-response case design
1 = Envelopes
2 = Step-by step
3 = Last step
4 = Envelopes - All
5 = Step-by step - All
Return Value
Type: Int32
 Returns zero if the item is successfully set; otherwise it returns a nonzero value.
See Also
Reference
cDCoAS_3600_2018 Interface
ETABSv1 Namespace